[LanguageOptions]
FontName=MS Sans Serif
FontSize=9
FontCharSet=1

[FrmMain]
PopDisplays.Caption=&Display the main program
PopExit.Caption=&Exit

FrmMain.Caption=Communication Management Software

S_Blue.Caption=Blue
S_Black.Caption=Black	
S_Silver.Caption=Silver
C_Language.Caption=Language
C_DeviceType.Caption=Machine Type

dxRibbon1Tab1.Caption=Device Management
dxRibbon1Tab2.Caption=Record Supervision
dxRibbon1Tab3.Caption=Employees Management
dxRibbon1Tab4.Caption=Record Management
dxRibbon1Tab5.Caption=U Disk Management

dxBarManager1Bar2.Caption=Devices Managment
dxBarManager1Bar4.Caption=Device Management
dxBarManager1Bar5.Caption=Real Time Management
dxBarManager1Bar6.Caption=Real-Time Monitoring Records Information
dxBarManager1Bar7.Caption=Employees Managment
dxBarManager1Bar8.Caption=Employees communication
dxBarManager1Bar9.Caption=Record Search
dxBarManager1Bar10.Caption=Export Record
dxBarManager1Bar12.Caption=Employee Checking
dxBarManager1Bar13.Caption=U Disk Management

S_AddC.Caption=Add Device
S_ModifyC.Caption=Modify Device
S_DelC.Caption=Delete Device
S_SearchDevice.Caption=Search Device
S_SyncTime.Caption=Synchronize time
S_Init.Caption=Initialize Device

S_Set.Caption=Device parameter
S_SetRing.Caption=Ring settings
S_SetGroup.Caption=Time zone/Group settings
S_Status.Caption=Auto update the T&A status

S_ReadNewRec.Caption=Download new record
S_ReadRec.Caption=Download all record
S_DelRec.Caption=Clear record

S_Backup.Caption=Backup Employees
S_Restore.Caption=Resume Employees

S_AddC.Hint=Add Device
S_ModifyC.Hint=Modify Device
S_DelC.Hint=Delete Device
S_SyncTime.Hint=Synchronize time
S_Init.Hint=Initialize Device

S_Set.Hint=Device parameter
S_SetRing.Hint=Ring settings
S_SetGroup.Hint=Time zone/Group settings
S_Status.Hint=Auto update the T&A status

S_ReadNewRec.Hint=Download new record
S_ReadRec.Hint=Download all record
S_DelRec.Hint=Clear record

S_Backup.Hint=Backup Employees
S_Restore.Hint=Resume Employees

cxTreeview2.Items[0].Text=All Groups
cxTreeview2.Items[1].Text=Group1
cxTreeview2.Items[2].Text=Group2
cxTreeview2.Items[3].Text=Group3
cxTreeview2.Items[4].Text=Group4
cxTreeview2.Items[5].Text=Group5

SP_Stop.Caption=Stop

S_Start.Caption=Activate realtime
S_End.Caption=Prohibit realtime

S_Start.Hint=Activate realtime
S_End.Hint=Prohibit realtime

E_Start.Caption=Start Time
E_End.Caption=End Time
E_Usercount.Caption=Employee Number
E_In.Caption=Check-in Times
E_Out.Caption=Check-out Times
E_Other.Caption=Other Status Times

E_Start.Hint=Start Time
E_End.Hint=End Time
E_Usercount.Hint=Employee Number
E_In.Hint=Check-in Times
E_Out.Hint=Check-out Times
E_Other.Hint=Other Status Times

C_U.Caption=U Disk
U_Refresh.Caption=Find U Disk
U_Record.Caption=Read Records from U Disk
U_Restore.Caption=Restore Employee from U Disk
U_Backup.Caption=Backup Employee to U Disk

S_All.Caption=Select All
S_Other.Caption=Reverse Selection
S_Up.Caption=Align Top	
S_Left.Caption=Align Left
S_Setlan.Caption=Setting Network Parameter
S_UnitInfo.Caption=Device information
S_OpenDoor.Caption=Open the door via software
S_Message.Caption=Message Management
S_ClearMG.Caption=Clear the manager
S_AttPic.Caption=Photo management
S_DownLoadLog.Caption=Download logs
S_SetMCard.Caption=Management Card settings
S_ListLog.Caption=Checking logs
S_MachineNumber.Caption=Setting Device Number
Set_GPRS.Caption=Set GPRS

S_AddD.Caption=Add Dept
S_ModifyD.Caption=Modify Dept
S_DelD.Caption=Delete Dept

S_AllU.Caption=Select All 
S_NoneU.Caption=Cancel Seletion

S_BaseSet.Caption=Basic Parameter Setting
S_State.Caption=T&A Statue Setting 
S_AutoDown.Caption=Timing Downloading Record
S_OP.Caption=Management PW Setting
S_DB.Caption=Database linking Setting
S_Exit.Caption=Exit System

cxGrid1DBTableView1Column1.Caption=No.
cxGrid1DBTableView1Column2.Caption=Name
cxGrid1DBTableView1Column3.Caption=Date/Time
cxGrid1DBTableView1Column4.Caption=Status Descrption
cxGrid1DBTableView1Column5.Caption=Terminal No.
cxGrid1DBTableView1Column6.Caption=Device ID
cxGrid1DBTableView1Column7.Caption=Device name
cxGrid1DBTableView1Column8.Caption=Department
cxGrid1DBTableView1Column9.Caption=Position
cxGrid1DBTableView1Column10.Caption=Work Code
cxGrid1DBTableView1Column11.Caption=Identification Method
cxGrid1DBTableView1Column12.Caption=Identification Method
cxGrid1DBTableView1Column13.Caption=Open the Door

S_AddU.Caption=Add Employee
S_ModifyU.Caption=Modify Employee
S_DelU.Caption=Delete Employee
S_Move.Caption=Transfer Department
S_SetPower.Caption=Set privilege
S_CopyPower.Caption=Copy Privilege
S_DownFP.Caption=Download Template
S_UpFP.Caption=Upload User&Template
S_DelU2.Caption=Delete from Unit

S_AddU.Hint=Add Employee
S_ModifyU.Hint=Modify Employee
S_DelU.Hint=Delete Employee
S_Move.Hint=Transfer Department
S_SetPower.Hint=Set Privilege
S_CopyPower.Hint=Copy Privilege
S_DownFP.Hint=Download Template
S_UpFP.Hint=Upload User&Template
S_DelU2.Hint=Delete from Device

E_Uid.Caption=Employee ID
E_Uname.Caption=Employee Name
E_Umachine.Caption=Device
S_SearchU.Caption=Check Employee

E_Uid.Hint=Employee ID
E_Uname.Hint=Employee Name
E_Umachine.Hint=Device
S_SearchU.Hint=Check Employee

cxGrid2DBTableView1Column1.Caption=Employee No.
cxGrid2DBTableView1Column2.Caption=Card No.
cxGrid2DBTableView1Column3.Caption=Name
cxGrid2DBTableView1Column4.Caption=Gender
cxGrid2DBTableView1Column5.Caption=Password
cxGrid2DBTableView1Column6.Caption=User Type
cxGrid2DBTableView1Column7.Caption=Position
cxGrid2DBTableView1Column8.Caption=Birthday
cxGrid2DBTableView1Column9.Caption=Employ Date
cxGrid2DBTableView1Column10.Caption=Phone
cxGrid2DBTableView1Column11.Caption=Address
cxGrid2DBTableView1Column12.Caption=Device
cxGrid2DBTableView1Column13.Caption=Dept. No.
cxGrid2DBTableView1Column14.Caption=Group
cxGrid2DBTableView1Column15.Caption=Verification Mode
cxGrid2DBTableView1Column16.Caption=FP1
cxGrid2DBTableView1Column17.Caption=FP2
cxGrid2DBTableView1Column18.Caption=FP3
cxGrid2DBTableView1Column19.Caption=FP4
cxGrid2DBTableView1Column20.Caption=FP5
cxGrid2DBTableView1Column21.Caption=FP6
cxGrid2DBTableView1Column22.Caption=FP7
cxGrid2DBTableView1Column23.Caption=FP8
cxGrid2DBTableView1Column24.Caption=FP9
cxGrid2DBTableView1Column25.Caption=FP10
cxGrid2DBTableView1Column26.Caption=Password
cxGrid2DBTableView1Column27.Caption=Face
cxGrid2DBTableView1Column28.Caption=Iris

S_Search.Caption=Search Record
S_Export.Caption=Export Record

S_Search.Hint=Search Record
S_Export.Hint=Export Record

E_From.Caption=Begin Date
E_To.Caption=End Date

E_Format.Caption=Export Format
E_Field.Caption=Export Field
E_DTFormat.Caption=Time Format
E_ULength.Caption=Employee No. Length
E_Space.Caption=Space Character
E_SLength.Caption=Space Character Length

E_Format.Items.Text=Text file(*.txt)\r\nCSV file(*.csv)\r\nExcel file(*.xls)
E_DTFormat.Items.Text=yyyy-mm-dd hh:mm:ss\r\nyyyy-m-d hh:mm:ss\r\nyy-mm-dd hh:mm:ss\r\nyyyymmddhhmmss
E_Space.Items.Text=,\r\n;\r\n_\r\n/\r\n-\r\nTab\r\nSpace

E_Field.Items[0].Description=No.
E_Field.Items[1].Description=Name
E_Field.Items[2].Description=Date/Time
E_Field.Items[3].Description=Device No.
E_Field.Items[4].Description=Device name
E_Field.Items[5].Description=Status
E_Field.Items[6].Description=Status Name
E_Field.Items[7].Description=Department
E_Field.Items[8].Description=Position

cxGrid3DBTableView1Column1.Caption=No.
cxGrid3DBTableView1Column2.Caption=Name
cxGrid3DBTableView1Column3.Caption=Date/Time
cxGrid3DBTableView1Column4.Caption=Status
cxGrid3DBTableView1Column5.Caption=Status Description 
cxGrid3DBTableView1Column6.Caption=Device No.
cxGrid3DBTableView1Column7.Caption=Device ID
cxGrid3DBTableView1Column8.Caption=Device Name
cxGrid3DBTableView1Column9.Caption=Dept
cxGrid3DBTableView1Column10.Caption=Position
cxGrid3DBTableView1Column11.Caption=Work Code
cxGrid3DBTableView1Column12.Caption=Verification Mode
cxGrid3DBTableView1Column13.Caption=Verification Mode
cxGrid3DBTableView1Column14.Caption=Open the Door

[FrmEditUser]
FrmEditUser.Caption=Add/Modify Employee Info

TabSheet1.Caption=Basic Info
TabSheet3.Caption=Fingerprint Registration

Label1.Caption=No.
Label2.Caption=Name
Label3.Caption=ID No.
Label7.Caption=Card No.
Label4.Caption=Gender
Label5.Caption=Nation
Label14.Caption=Political Feature
Label6.Caption=Birthday
Label12.Caption=Employ Date
Label9.Caption=Position
Label17.Caption=Education
Label10.Caption=Phone
Label13.Caption=Native Place
Label15.Caption=Address
Label8.Caption=Speciality
Label11.Caption=Mobile

Label19.Caption=Dept.
Label20.Caption=Group Number
Label16.Caption=User Type
Label18.Caption=Verification Mode
Label21.Caption=Password


CB1.Caption=Device Default
CB2.Caption=FP
CB3.Caption=FP+PW
CB4.Caption=FP+PW+Card
CB5.Caption=ID+PW
CB6.Caption=ID+FP
CB7.Caption=ID+PW+FP
CB8.Caption=Card
CB9.Caption=Card+PW
CB10.Caption=Card+FP

B_OK.Caption=OK
B_Cancel.Caption=Cancel

L_xb.Items.Text=Male\r\nFemale
L_zzmm.Items.Text=Community Member\r\nParty Member
L_yhlx.Items.Text=Normal User\r\nAdministrator

//L_bdfs.Items.Text=Sept\r\nRF+FP\r\nPW+FP\r\nRF+PW\r\nID+FP
L_bdfs.Items.Text=Sept\r\nRForFP\r\nFP\r\nRF+FP
L_bdfs.Items.Text1=Sept\r\nPW+FP\r\nID+FP
L_bdfs.Items.Text2=Sept\r\nRF+FP\r\nPW+FP\r\nRF+PW\r\nID+FP
L_bdfs.Items.Text3=Sept\r\nRF+PW
L_bdfs.Items.Text4=Sept\r\nRForFP\r\nFP\r\nRF+FP

GroupBox2.Caption=FP Enroll 

CB_Finger1.Caption=Fingerprint1
CB_Finger2.Caption=Fingerprint2
CB_Finger3.Caption=Fingerprint3
CB_Finger4.Caption=Fingerprint4
CB_Finger5.Caption=Fingerprint5
CB_Finger6.Caption=Fingerprint6
CB_Finger7.Caption=Fingerprint7
CB_Finger8.Caption=Fingerprint8
CB_Finger9.Caption=Fingerprint9
CB_Finger10.Caption=Fingerprint10

S_Enroll1.Caption=Enroll
S_Enroll2.Caption=Enroll
S_Enroll3.Caption=Enroll
S_Enroll4.Caption=Enroll
S_Enroll5.Caption=Enroll
S_Enroll6.Caption=Enroll
S_Enroll7.Caption=Enroll
S_Enroll8.Caption=Enroll
S_Enroll9.Caption=Enroll
S_Enroll10.Caption=Enroll

S_OK.Caption=&Save
S_Exit.Caption=&Cancel

[FrmLogin]
FrmLogin.Caption=System Logining...
Label2.Caption=System Logining

Label1.Caption=Management PWD:
SP_OK.Caption=&OK
SP_Exit.Caption=&Cancel

[FrmInputDept]
FrmInputDept.Caption=Input Department Name

Label1.Caption=Please Input Department Name:
S_OK.Caption=&OK
S_Exit.Caption=&Cancel

[FrmNew]
FrmNew.Caption=Devices Management

GroupBox1.Caption=Device Info
GroupBox2.Caption=Communication Mode

Label1.Caption=Terminal No.
Label2.Caption=Device ID
Label3.Caption=Device Name
Label4.Caption=Device Group
Label5.Caption=T&A Status
Label6.Caption=(Check Device ID from the device menu) 

E_Group.Items.Text=Group1\r\nGroup2\r\nGroup3\r\nGroup4\r\nGroup5
E_ZT.Items.Text=Real Status\r\nOn Duty\r\nOff Duty
GroupBox3.Caption=Device Type
Label7.Caption=Device Type
E_Type.Items.Text=Fingerprint/Card Verify\r\nFacial Verify FacePass
GroupBox4.Caption=Communication Parameter
Label8.Caption=IP Address
Label9.Caption=Comm PWD
Label10.Caption=Comm Port



RB1.Caption=COM
RB2.Caption=LAN
RB3.Caption=RS485
RB4.Caption=USB(no driver)
RB5.Caption=LAN(Client)

S_OK.Caption=&OK
S_Exit.Caption=&Cancel

[FrmAutoDown]
FrmAutoDown.Caption=Timing Downloading Record

CB1.Caption=Run Timing Downloading Record
Label1.Caption=Downloading Time:
Label2.Caption=Time:
S_Add.Caption=Add
S_Clear.Caption=Delete Time
S_OK.Caption=&OK
S_Exit.Caption=&Cancel

[FrmSet]
FrmSet.Caption=Device Parameter Settings

Label1.Caption=Management Password(0-999999)
Label2.Caption=Sleep time(0-250 minute)
Label3.Caption=Volume(0-5)
Label4.Caption=Language
Label5.Caption=Date format
Label15.Caption=Time format

Label6.Caption=Matching Precision
Label7.Caption=Record Alarm Threshold Value(0-5000)
Label8.Caption=Time Period between Repeated Clocking(0-250 minute)
Label9.Caption=Workcode Prompt
Label10.Caption=Realtime Monitor Function
Label11.Caption=Ring Function
Label11.Caption2=Relay Settings
Label16.Caption=Intelligently Update  FP Template 

Label12.Caption=Wiegand Mode
Label13.Caption=Fixed Wiegand Area Code(0-254)
Label14.Caption=Lock Relay Time(0-15 second)

Label18.Caption=Default Verification Mode on the Device
Label17.Caption=Door Contact Alarm Delay(0-250)

Label19.Caption=Add Card
Label20.Caption=Delete Card

Label21.Caption=Reboot Time
Label26.Caption=Time Calibration (± 60)：

CB1.Caption=Device default
CB2.Caption=FP
CB3.Caption=FP+PW
CB4.Caption=FP+PW+Card
CB5.Caption=ID+PW
CB6.Caption=ID+FP
CB7.Caption=ID+PW+FP
CB8.Caption=Card
CB9.Caption=Card+PW
CB10.Caption=Card+FP

B_OK.Caption=OK
B_Cancel.Caption=Cancel

E_Language.Items.Text=Simplified Chinese\r\nTraditional Chinese\r\nEnglish\r\nFrench\r\nGerman\r\nSpanish\r\nPortuguese\r\nItalian\r\nBulgarian\r\nSlovak\r\nHungarian\r\nSlovenian
E_DTFormat.Items.Text=yy-mm-dd\r\nmm/dd/yy\r\ndd/mm/yy
E_TTFormat.Items.Text=24 Hour\r\n12 Hour
E_ver.Items.Text=Normal\r\nGood\r\nExact
E_Workcode.Items.Text=Disable\r\nEnable
E_RealTime.Items.Text=Disable\r\nEnable
E_Ring.Items.Text=Disable\r\nEnable
E_Ring.Items.Text2=1-Ring  2-Lock\r\n1-Lock  2-Close\r\n1-Close  2-Lock\r\n1-Lock  2-Lock\r\n1-Close  2-Close
E_Update.Items.Text=Disable\r\nEnable

E_wiegand.Items.Text=Wiegand26\r\nAnviz Wiegand\r\nFixed Wiegand area code 

S_Default.Caption=Display Default setting
S_OK.Caption=&OK
S_Exit.Caption=&Cancel

Label22.Caption=Company name
Label23.Caption=Company Address
Label24.Caption=Company Tax
Label25.Caption=FacePass device without above functions.

S_Init.Caption=Initialize Device
S_DelRec.Caption=Clear Device

[FrmSetRing]
FrmSetRing.Caption=Set Ring Time

Label1.Caption=Ring Time list
Label2.Caption=Ring Time

GroupBox1.Caption=Detailed Information

CB1.Caption=Monday
CB2.Caption=Tuseday
CB3.Caption=Wednesday
CB4.Caption=Thursday
CB5.Caption=Friday
CB6.Caption=Saturday
CB7.Caption=Sunday

S_Add.Caption=&Add
S_Del.Caption=&Delete
S_OK.Caption=&OK
S_Exit.Caption=&Cancel

[FrmSetGroup]
FrmSetGroup.Caption=Set Time Zone/Group

gbSect.Caption=Time Zone Setting
Label11.Caption=Timze Zone Number
Label12.Caption=Monday Start/End Time
Label13.Caption=Tuesday Start/End Time
Label14.Caption=Wednesday Start/End Time
Label15.Caption=Thursday Start/End Time
Label16.Caption=Friday Start/End Time
Label17.Caption=Saturday Start/End Time
Label18.Caption=Sunday Start/End Time
S_ApplySect.Caption=Set

gbGroup.Caption=Group Settings
Label01.Caption=Group Number
Label02.Caption=Time Zone 1
Label03.Caption=Time Zone 2
Label04.Caption=Time Zone 3
Label05.Caption=Time Zone 4
S_ApplyGrp.Caption=Set

S_Exit.Caption=Exit

[FrmSetPower]
FrmSetPower.Caption=Set Privilege

cxTreeview1.Items[0].Text=Group1	
cxTreeview1.Items[1].Text=Group2
cxTreeview1.Items[2].Text=Group3
cxTreeview1.Items[3].Text=Group4
cxTreeview1.Items[4].Text=Group5

S_OK.Caption=&OK
S_Exit.Caption=&Cancel

[FrmSDept]
FrmSDept.Caption=Employee Tansfer

Label1.Caption=Please select the department:
S_OK.Caption=&OK
S_Exit.Caption=&Cancel

[FrmSetPwd]
FrmSetPwd.Caption=Modify Management Password

Label1.Caption=Old Pwd:
Label2.Caption=New Pwd:
Label3.Caption=Comfirm Pwd:
S_OK.Caption=&OK
S_Exit.Caption=&Cancel

[FrmStatus]
FrmStatus.Caption=T&A Status setting

Label1.Caption=Please sort it in ascending order.
cxGrid1DBTableView1Column1.Caption=Status Value
cxGrid1DBTableView1Column2.Caption=Symbol
cxGrid1DBTableView1Column3.Caption=Status Descriprion

S_Get.Caption=Retrieve from the selected terminal
S_Set.Caption=Upload to the selected terminal

[FrmPicture]
FrmPicture.Caption=Edit Picture

S_Select.Caption=&View
S_Save.Caption=&Save
S_Restore.Caption=&Restore
S_Cut.Caption=Cut&Down
S_Exit.Caption=&Close

Groupbox1.Caption=Zoom in/out

[FrmBaseSet]
FrmBaseSet.Caption=Basic Parameter Setting

Groupbox1.Caption=Basic Parameter
Label1.Caption=Com Port Communication delay time(1-10) Seconds
Label2.Caption=Network Communication delay time(1-20) Seconds
Label3.Caption=IP Port
Label4.Caption=FacePass NTP-SERVER IP
CB1.Caption=Communication Failed, Automatically Exit Current Operation
CB2.Caption=In Realtime Monitoring, Voice prompts "Department Name"
CB3.Caption=Clear the data after downloading

S_OK.Caption=&OK
S_Exit.Caption=&Cancel

[FrmCopyPower]
FrmCopyPower.Caption=Copy Function and Privilege 

Label1.Caption=Copied Employee ID

S_OK.Caption=&OK
S_Exit.Caption=&Cancel

[FrmPhoto]
FrmPhoto.Caption=Pictures Shooting

Label1.Caption=Camera 

S_Take.Caption=&Take Pic.
S_Save.Caption=&Save
S_Restore.Caption=&Restore
S_Cut.Caption=Cut&Down
S_Exit.Caption=&Close

Groupbox1.Caption=Zoom In/Out

[FrmNetinfo]
FrmNetinfo.Caption=Set the terminal's IP configuration

Groupbox1.Caption=Set the terminal's IP configuration

CB1.Caption=IP address:
CB2.Caption=Default gateway:
CB3.Caption=Sub mask:
CB4.Caption=MAC address:
CB5.Caption=Server IP address:
CB6.Caption=Work mode:
CB6_Flag.Items.Text=Server\r\nClient
CB7.Caption=Comm Port

S_OK.Caption=&OK
S_Exit.Caption=&Cancel

[FrmUnitInfo]
FrmUnitInfo.Caption=Device Information

Groupbox1.Caption=Device Information
Label1.Caption=User Number
Label2.Caption=Fingerprint Number
Label3.Caption=Password Number
Label4.Caption=Card Number
Label5.Caption=New records Number
Label6.Caption=Total records Number
Label7.Caption=Firmware Version
Label8.Caption=Device SN

S_Get.Caption=&Retrieve
S_Exit.Caption=&Cancel

[FrmMessage]
FrmMessage.Caption=Message Management

Label1.Caption=Message Type
Label2.Caption=Employee ID
Label3.Caption=Start Date
Label4.Caption=End Date
Label5.Caption=Message Content
Label6.Caption=Message List

E_Flag.Items.Text=Private Message\r\nPublic Message

cxGrid1DBTableView1Column1.Caption=NO.
cxGrid1DBTableView1Column2.Caption=Message Type
cxGrid1DBTableView1Column3.Caption=Employee ID
cxGrid1DBTableView1Column4.Caption=Name
cxGrid1DBTableView1Column5.Caption=Begin date
cxGrid1DBTableView1Column6.Caption=End date
cxGrid1DBTableView1Column7.Caption=Message Content

S_Add.Caption=Add Message
S_Read.Caption=Read Message
S_DelAll.Caption=Delete All Messages
S_DelSel.Caption=Delete Selected Messages

[FrmSetStatus]
FrmSetStatus.Caption=T&A Status Auto Switch Settings

GroupBox1.Caption=T&A Status Auto Switch Settings
Label1.Caption=Set SN
Label11.Caption=T&A Status
Label12.Caption=Monday Start/End Time
Label13.Caption=Tuesday Start/End Time
Label14.Caption=Wednesday Start/End Time
Label15.Caption=Thursday Start/End Time
Label16.Caption=Friday Start/End Time
Label17.Caption=Saturday Start/End Time
Label18.Caption=Sunday Start/End Time
S_Get.Caption=Retrieve
S_Set.Caption=Set
S_Exit.Caption=Exit

[FrmAttPic]
FrmAttPic.Caption=User Photo Management

S_ReadInfo.Caption=Retrieve Photo Information
S_ReadFile.Caption=Retrieve Selected Photo
S_Delall.Caption=Delete All Photos
S_Delsel.Caption=Delete Selected Photos

cxGrid1DBTableView1Column1.Caption=No.
cxGrid1DBTableView1Column2.Caption=Employee No.
cxGrid1DBTableView1Column3.Caption=Name
cxGrid1DBTableView1Column4.Caption=Time
cxGrid1DBTableView1Column5.Caption=Saved

[FrmDownLoadLog]
FrmDownLoadLog.Caption=Management Logs
Label1.Caption=Start Date
Label2.Caption=End Date
cxButton1.Caption=Select

cxGrid3DBTableView1Column1.Caption=#
cxGrid3DBTableView1Column2.Caption=No.
cxGrid3DBTableView1Column3.Caption=Name
cxGrid3DBTableView1Column4.Caption=Date/Time
cxGrid3DBTableView1Column5.Caption=Device ID
cxGrid3DBTableView1Column6.Caption=Logs
Admin=Administrator
Communication=Communication

[FrmSetMachineNumber]
FrmSetMachineNumber.Caption=Setting
Label1.Caption=Machine No.
Button1.Caption=OK
Button2.Caption=Cancel

[FrmGPRS]
FrmGPRS.Caption=GPRS
LGGSN.Caption=APN
LsIP.Caption=GPRS Server
LIP.Caption=Local IP address
LPort.Caption=Port
LUN.Caption=User Name
LPW.Caption=Password
TBEnabled.Caption=Open
BOK.Caption=Set
BCancel.Caption=Cancel

[Resource]

DeptName=Head Quarters

AttFlag1=Fingerprint1
AttFlag2=Fingerprint2
AttFlag3=Password
AttFlag4=Card
AttFlag5=Face
AttFlag6=Iris

StaffID=ID:
StaffName=Name:
StaffDept=Dept.:
StaffDuty=Position:

MachineID=Terminal Number:
MachineName=Device Name:
MachineSID=Device ID:
MachineFlag10=Communication Mode:USB
MachineFlag11=Com Port:
MachineFlag20=Communication Mode:LAN
MachineFlag21=IP Address:
MachineFlag22=Communication Mode:RS485
MachineFlag23=Communication Mode:USB
MachineFlag24=Communication Mode:LAN(Client)
MachineLink1=Connection State:Abnormal
MachineLink2=Connection State:Normal
MachineUser=Employees:
MachineFP=FingerPrints:
MachineRecord=Records:
MachineNewRecord=New Records:

LinkDB=Database connecting successful,please restart the software!
LinkDBError=Database connecting failed, Please collocate the database again!
ExitSystem=Are you sure to exit?

ErrorPwd=Wrong admin password,you have %d chances to try again,\r\n Please enter the admin password again!
AutoExitSystem=Wrong admin password,system ends!

Savedialog1.Filter1=Text file (*.txt)|*.txt
Savedialog1.Filter2=CSV file (*.csv)|*.csv
Savedialog1.Filter3=Excel file (*.xls)|*.xls

Opendialog1.Filter1=Image file (*.jpg)|*.jpg

FileExist=This folder contains a file" %s ",\r\n If replace the existing file?
OutFile=Records have been exported to " %s "

NOExcel=You have not installed Microsoft Excel in your computer!

ErrorDeptlist=Read department list error!

[Message]

MsgCaption1=System Prompt
MsgCaption2=Please confirm...
NoSelected=No employee selected!

Msg00=This operation will deal with the selected machine:%sAre you sure to continue?
Msg1=Synchronization failed
Msg2=Synchronization successful!
Msg3=Initialization failed!
Msg4=Initialization successful!
Msg5=Failed to open the door via software!
Msg6=Open the door via software successfully!
Msg7=Failed to set the ring time!
Msg8=Set the ring time successfully!
Msg9=Failed the time zone!
Msg10=Set the time zone successfully!
Msg11=Failed to set the Group!
Msg12=Set the group successfully!
Msg13=Parameter setting failed!
Msg14=Parameter setting Successful!

Msg15=Read the records failed!
Msg16=Read the records completed,Records:%d ,Read successfully:%d 
Msg17=Backup employee failed!
Msg18=Backup employee information completed,Records:%d ,Read successfully:%d 
Msg19=Starting Backup user template...
Msg20=
Msg21=
Msg22=Backup Successed!
Msg23=Download fingerprint %d failed
Msg24=
Msg25=Template Download Successed!
Msg26=Deletion failed
Msg27=Delete the employee from the device completely
Msg28=Upload fingerprint 1failed
Msg29=Upload fingerprint 1failed, fingerprint template error
Msg30=Upload fingerprint 2failed
Msg31=Upload fingerprint 2failed, fingerprint template error
Msg32=Upload employee failed
Msg33=Upload user and template successed!

Msg34=
Msg35=Upload fingerprint %d failed
Msg36=Failed to set the network parameters
Msg37=Set the network parameters successfully

Msg38=Get back failed
Msg39=Get back employees completed
Msg40=Have not select the T&A machine!
Msg41=Synchronizing time...
Msg42=Can not connect to the T&A machine
Msg43=Synchronization completed
Msg44=Initializing...
Msg45=Initialization completed

Msg46=Failed to retrieve the terminal parameters
Msg47=No new record
Msg48=No record
Msg49=No user
Msg50=Setting ring time...
Msg51=Set the ring time successfully.

Msg52=Please select one T&A machine!

Msg53=Setting the time zone...
Msg54=Set the time zone successfully
Msg55=Setting the group...
Msg56=Set the group successfully
Msg57=Failed to set the network parameters!
Msg58=Set the network parameters successfully. Please restart the T&A machine!

Msg59=Set Advanced Parameter...
Msg60=Set advanced parameter complete
Msg61=Reading attendance records...
Msg62=Read attendance records:
Msg63=Read attendance records completed
Msg64=Backupping employees...
Msg65=Backup employee:
Msg66=Backup employee completed
Msg67=Get back employees...
Msg68=Get back employees:
Msg69=Get back employees completed
Msg70=Download Template...
Msg71=Download Template
Msg72=Download Template Successed
Msg73=Upload User and Template...
Msg74=Upload User and Template
Msg75=Upload User and Template Successed!
Msg76=Delete the employee from the device...
Msg77=Delete the employee from the deviece:
Msg78=Delete the employee from the deviece completed
Msg79=Already have this department!
Msg80=Are you sure to delete the selected department?
Msg81=Are you sure to delete the selected employee?
Msg82=Please select the field!
Msg83=The employee ID can not be empty,please input the ID!
Msg84=Already have this employee ID,please input again.!
Msg85=The terminal information is not complete!
Msg86=Already have the machine number and the device ID 
Msg87=The old password is incorrect,please enter the password again!
Msg88=Confirmation failed,please enter the new password again!
Msg89=Admin password modification successful!

Msg90=No more than 30 ring time!
Msg91=Repeated ring time!

Msg92=Connect to the fingerprint sensor reader successfully!
Msg93=Fingerprint sensor reader not connected!
Msg94=Please press your finger...
Msg95=Enrollment successful! 

Msg96=Nothing selected!
Msg97=Wrong picture size. Please select the suitable picture. 

Msg98=Are you sure to delete the selected ring time?

Msg99=The device has no such function.
Msg100=The user is saved. Are you sure to add a new user again?

Msg101=No such ID existed, recovery failed!
Msg102=Update employee information to Cache...

Msg103=Update employee information to terminal...
Msg104=Employee information updating complete!

Msg105=Max. 5 Time can be set!
Msg106=This time already exists!
Msg107=Enter timing downloading time!
Msg108=Timing downloading setting complete!
Msg109=Are you sure to exit current operation?
Msg110=Exit current operation
Msg111=Timing downloading ignored,Other operations in Process!

Msg112=Basic Parameters setting successful!
Msg113=Are you sure to copy the selected employee's privilege?
Msg114=The Selected employee's privileges are successfully copied!
Msg115=Employee ID not exited, please check!

Msg116=Clear time attendance records successfully
Msg117=Failed to clear the time attendance records
Msg118=Clearing time attendance records...
Msg119=Failed to read the records amount from the T&A machine
Msg120=Failed to resume the employees
Msg121=Failed to upload the employees.
Msg122=Finish clearing the time attendance records
Msg123=Failed to obtain the IP configuration
Msg124=Invalid IP address!
Msg125=Failed to set the IP address!
Msg126=Set the IP address successfully!
Msg127=Invalid default gateway!
Msg128=Failed to set the default gateway!
Msg129=Set the default gateway successfully!	
Msg130=Invalid sub mask!
Msg131=Failed to set the sub mask!
Msg132=Set the sub mask successfully!
Msg133=Invalid MAC address!
Msg134=Failed to set the MAC address!
Msg135=Set the MAC address successfully!
Msg136=Invalid server IP address!
Msg137=Failed to set the server IP address!
Msg138=Set the server IP address successfully!
Msg139=Failed to retieve the terminal information!
Msg140=Add message fail!
Msg141=Add message successful!
Msg142=Input message not complete!
Msg143=Public message
Msg144=Private message
Msg145=Are you sure to delete selected message?
Msg146=Delete message fail
Msg147=Delete message successful
Msg148=Are you sure to delete all messages?
Msg149=Registration overtime!
Msg150=Please place fingerprint again...
Msg151=Register failed，please register again!
Msg152=Fingerprint repeated, please register again!
Msg153=Loading fingerprint templates...
Msg154=Fingerprint template loading complete.





Msg159=Employee ID first digit can't be 0, Please input again.

Msg160=Entered Card number is already existent.Please enter the card number again!
Msg161=Card number first digit can't be 0, Please input again.
Msg162=Are you sure to to disable the manager ?
Msg163=Failed to disable the manager!
Msg164=Disable the manager successfully!

Msg165=Failed to retrieve the terminal type!
Msg166=Faield to retrieve the terminal status list.
Msg167=Retrieve the terminal status list successfully.
Msg168=Set terminal status list...
Msg169=Set terminal status list finished
Msg170=Failed to set the terminal status list. 
Msg171=Set the terminal status list successfully. 

Msg172=Failed to set auto updating T&A status
Msg173=Set the auto updating T&A status successfully
Msg174=Failed to retrieve the auto updating T&A status settings.
Msg175=Retrieve the auto updating T&A status settings successfully.
Msg176=Set the auto updating T&A status...
Msg177=Set the auto updating T&A status finished

Msg178=Failed to retrieve the photo captured by the device's camera.
Msg179=Failed to retrieve the number of the photo captured by the device's camera.
Msg180=Retrieve the photo successfully. Records:%d， success: %d.
Msg181=Are you sure to delete all photos? 
Msg182=Failed to delete the photo!
Msg183=Delete the photo successfully!

Msg184=Are you sure to delete the selected photo? 
Msg185=Are you sure to retrieve the selected photo? 
Msg186=Failed to retrieve the photo!
Msg187=Retrieve the photo successfully!

Msg188=Message content exceeds the allowable range.
Msg189=Failed to download logs！
Msg190=Download logs successfully. Records:%d， success: %d.
Msg191=Failure to set the machine number
Msg192=Successfully set the machine number

//U Disk
Msg193=Cannot find the U disk in your PC!
Msg194=Select the direction:
Msg195=Can not find the file %s in the U disk!
Msg196=Can not find file %s in the U disk!
Msg197=There is no employee in the database!
Msg198=Backup the employee to U disk...
Msg199=Save the employee to:
Msg200=Save the fingerprint template to:
Msg201=Backup the employee to U disk successfully!

Msg203=The employee ID in this record is not existent!
Msg204=Repeated record:
Msg205=The folder doesn't contains the terminal ID!
Msg206=Read records...
Msg207=File contents are incorrect!
Msg208=Records number:%d ; Success:%d
Msg209=Read employee information...
Msg210=Employee number:%d ; Success:%d
Msg211=Read fingerprint template...
Msg212=Fingerprint template number:%d ; Success:%d
Msg213=Failed to set the GPRS
Msg214=Set the GPRS success
Msg215=Failed to get GPRS information
Msg216=Obtain successful GPRS information

Msg217=Input port of the communication is not legal!
Msg218=Please check the connection with the PC!
Msg219=Upload department information
Msg220=Upload department failed
Msg221=Upload department successed
Msg222=Please verify administrator on the device.
Msg223=Template download failed!

